     A*%%TS  SD  20260414  222002  RMAHLA      REL-V7R5M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A          R HEADER
     A*%%TS  SD  20260414  213406  RMAHLA      REL-V7R5M0  5770-WDS
     A                                  1 32'RPGenius Analyzer'
     A                                      COLOR(WHT)
     A                                  1  6USER
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  2 64TIME
     A                                  6 15'Name:'
     A                                      COLOR(WHT)
     A            NAMEFLD       10  0O  6 22
     A                                  8 15'Dept:'
     A                                      COLOR(WHT)
     A            DEPTFLD        9  0B  8 23
     A            ERRMSG        20   O 22  9COLOR(RED)
     A          R SOMEREC                   SFL
     A*%%TS  SD  20260414  222002  RMAHLA      REL-V7R5M0  5770-WDS
     A            FLD001         2  0O 14  7
     A            FLD002        10   O 14 15
     A            FLD003         5   O 14 30
     A          R SOMERECTL                 SFLCTL(SOMEREC)
     A*%%TS  SD  20260414  222002  RMAHLA      REL-V7R5M0  5770-WDS
     A  41                                  SFLDSP
     A  42                                  SFLCLR
     A  43                                  SFLEND
     A                                      SFLSIZ(0099)
     A                                      SFLPAG(0006)
     A                                 13  7'ID'
     A                                      COLOR(WHT)
     A                                 13 15'Name'
     A                                      COLOR(WHT)
     A                                 13 30'Dept'
     A                                      COLOR(WHT)

